public/programming/notes/root-a-samsung-galaxy-j5.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://san7o.github.io/micro-style.css/micro-style.css" />
<link rel="icon" href="/giovanni-diary/favicon.ico" type="image/x-icon">
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://san7o.github.io/giovanni-diary/logo.png">
<meta property="og:url" content="https://san7o.github.io/giovanni-diary/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../../subjects.html">Subjects</a> &gt; <a href="../programming.html">Programming</a> &gt; <a href="notes.html">Notes</a> &gt;
</p>
<div id="outline-container-org8e8f15e" class="outline-2">
<h2 id="org8e8f15e">How to root a Samsung Galaxy J5 (2016)</h2>
<div class="outline-text-2" id="text-org8e8f15e">
</div>
<div id="outline-container-orgc29e4ee" class="outline-4">
<h4 id="orgc29e4ee">Index</h4>
<div class="outline-text-4" id="text-orgc29e4ee">
<ul class="org-ul">
<li>The processes</li>
<li>1. Boot a custom recovery image</li>
<li>2. Install a special applications</li>
<li>3. Enjoy the power</li>
<li>Installing an alternative OS</li>
</ul>

<p>
Rooting android your first time is a frustrating experience at best.
It took me more than necessary to get root privileges on my phone,
therefore I am writing a quick guide for my future self when he will
need my assistance. This document explains the steps I took to
successfully root my android phone.
</p>

<p>
Note that the process may vary in several ways, mainly depending on
the model of the phone you are trying to root. This guide is written
specifically for the Samsung Galaxy J5 (2016), however most of the
steps should be similar hopefully. It is advised to read this article
first before attempting to root your phone.
</p>
</div>
</div>
<div id="outline-container-org4dacce4" class="outline-4">
<h4 id="org4dacce4">The process</h4>
<div class="outline-text-4" id="text-org4dacce4">
<p>
To root a phone we need something else with root privileges to grant
us the same status. Of course, stock Android will never let us get
even a glimpse of this power for security reasons so we need to find a
workaround.  The solution is to boot a custom recovery image, which has
high privileges, to install some applications with root status. We
can leverage this to install a special app that gives permissions to
other apps during normal system execution.
</p>

<p>
To recap, we need to do the following to achieve root:
</p>
<ol class="org-ol">
<li>Boot a custom recovery image</li>
<li>Install a special application</li>
<li>Enjoy the power</li>
</ol>

<p>
Note that you might mess things up and lose all your data, so be
prepared.  Probably you will also lose your device's warranty.
</p>

<p>
You have been warned :-)
</p>
</div>
</div>
<div id="outline-container-orge457019" class="outline-4">
<h4 id="orge457019">1. Boot a custom recovery image</h4>
<div class="outline-text-4" id="text-orge457019">
<p>
We need to download a custom recovery image for your phone model.
There are many cool looking alternatives, I used TWRP and it can be
downloaded from the official website. Note that you need to choose the
right version based on your phone.  I downloaded the <code>.img</code> file,
compressed it in a tar archive and renamed it <code>recovery.tar</code>.
</p>

<div class="org-src-container">
<pre class="src src-bash">wget https://.../something.img
tar -cf something.tar something.img
mv something.img recovery.zip
</pre>
</div>

<p>
Now we need to put this into our device. We need to boot into download
mode which on my smartphone is <code>VOL_DOWN + HOME + POWER</code>. After this
we can interact with the device, I used <code>odin4</code> (linux version) for
this. To check that oding can talk to the device, run <code>odin4 -l</code> and
expect some output. If it does not show anything I cannot help you, it
is probably a driver problem, good luck, I believe in you, trust in
yourself, you are strong. If you get some permission error, you need
to set something on your udev, just follow closely the help output
and you should be good to go.
</p>

<p>
Then load the recovery mode with <code>odin4 -a recovery.zip</code> and,
IMMEDIATELY after it finishes, you need to boot in recovery mode,
which on my phone is done via <code>VOL_UP + HOME + POWER</code>. You need to be
QUICK, REALLY QUICK!!! Keep trying until you manage to do this. If
everything was successful, you are now greeted with a cool recovery
program.
</p>
</div>
</div>
<div id="outline-container-org416f9f5" class="outline-4">
<h4 id="org416f9f5">2. Install a special application</h4>
<div class="outline-text-4" id="text-org416f9f5">
<p>
We now need to install something that will make other things root. We
can use Magisk, you can download the apk from the official github
releases and rename it to a <code>.zip</code> file. We need to send it to the
device and we will use <code>adb</code> from the official platform tools. Just
extract the archive.
</p>

<p>
On the device, select <code>advanced -&gt; sideload -&gt; swipe to start
sideload</code>.  On your pc, run <code>adb sideload app-release.zip</code>, this
should install magisk and it should show the installation on the
phone. After this finishes, reboot your phone, go to your apps and
open Magisk, it may ask to be installed again, just say yes, follow
the installation instructions (just tap two buttons), maybe close it
and reopen it, reboot and&#x2026;  we are root!
</p>

<p>
You can check this by installing RootChecker.
</p>
</div>
</div>
<div id="outline-container-orgfe43884" class="outline-4">
<h4 id="orgfe43884">3. Enjoy the power</h4>
<div class="outline-text-4" id="text-orgfe43884">
<p>
Now that you are root you can do a bunch of cool things like wipe out
everything and install gentoo. A more useful thing would be to install
an adblocker (I'd suggest <code>adAway</code>) so that you can actually read blogs
and news in peace.
</p>
</div>
</div>
<div id="outline-container-orgd26851e" class="outline-4">
<h4 id="orgd26851e">Installing an alternative OS</h4>
<div class="outline-text-4" id="text-orgd26851e">
<p>
There are plenty of alternatives and variations of Android out there,
the only constraint is that they need to support your phone.  You
could theoretically make your own build but I have no idea how you
would resolve drivers. I aplogize for my ignorance, you'll have to
figure it out some day.  I found <a href="https://community.e.foundation/t/unofficial-builds-samsung-galaxy-j5-series-for-e-os-r/56461/3">this</a> unofficial build of /e/OS,
hopefully the link still works.
</p>

<p>
After you have installed the custom recovery media, you can start the
sideload just as you did for Makisk in the previous section, and load
the downloaded archive. That is really it, you should have a working
OS.  If the process fails and you cannot boot the OS correctly, you
should be able to access the recovery mode on startup assuming that
you can turn off your device. In my experience, when the boot broke, I
could not power it off so I just removed the battery and
rebooted. Unfortunately, you cannot do this in new phones (sight), so
you may try to make it discharge until ti powerd off, gook luck.
</p>

<hr />

<p>
Travel: <a href="../programming.html">Programming</a>, <a href="../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
